app/controllers/holidays_controller.rb

  def index
    @nxt = Holiday.where("holday >= ?", Date.today).order(holday: :asc).first
---
SELECT "holidays".* FROM "holidays" WHERE (holday >= '2022-02-04') ORDER BY "holidays"."holday" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @holiday = Holiday.new(holiday_params)
    # if @question.save
    #   redirect questions_path, :notice => "Successfully created question."
    # else
    #   setup_questions
    #   render :action => :index
    # end
    # binding.pry
    respond_to do |format|
      if @holiday.save
---
INSERT INTO "holidays" ("holi_day", "date_details", "created_at", "updated_at", "holday") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["holi_day", nil], ["date_details", "aa"], ["created_at", "2022-02-02 09:15:01.884209"], ["updated_at", "2022-02-02 09:15:01.884209"], ["holday", "2022-02-03"]]

  def destroy
    @holiday.destroy
---
DELETE FROM "holidays" WHERE "holidays"."id" = $1  [["id", 10]]

    def set_holiday
      @holiday = Holiday.find(params[:id])
---
SELECT "holidays".* FROM "holidays" WHERE "holidays"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

    def setup_holidays
    if params[:search] && !params[:clear].present?
    search_term = params[:search].downcase.gsub(/\s+/, "")
    @holidays = Holiday.where("holday >= ?", Date.today).order(holday: :desc).select { |holyday| holyday.date_details.include?(search_term) || holyday.holday.strftime("%d %b %Y").to_s.downcase.include?(search_term)}
    else
      @holidays = Holiday.where("holday >= ?", Date.today).order(holday: :desc)
---
SELECT "holidays".* FROM "holidays" WHERE (holday >= '2022-02-04') ORDER BY "holidays"."holday" DESC